<a href="https://colab.research.google.com/github/ua-datalab/DataEngineering/blob/main/04_Workshop_Feb_19_2024.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **Workshop 4: Introduction to SQL and duckDB Part 2 -**

# Agenda:
- **SQL Recap and Functions, Sub-queries**
- **Creating Tables and Inserting Data**
- **Exporting data to CSV**
- **Importing data from CSV to duckdb**

In [ ]:
import duckdb

# Working with an available dataset (Covid19-patients 100k synthetic dataset)
## Dataset Link [Link](https://mitre.box.com/shared/static/wk3560f962ozlg7sd2oj1zxk73ayqvm0.zip)

## Let's download the database file

In [ ]:
!wget --content-disposition https://arizona.box.com/shared/static/uozg0z86rtdjupwpc7i971xwzuzhp42o.duckdb

--2024-02-19 00:07:51--  https://arizona.box.com/shared/static/uozg0z86rtdjupwpc7i971xwzuzhp42o.duckdb
Resolving arizona.box.com (arizona.box.com)... 74.112.186.144
Connecting to arizona.box.com (arizona.box.com)|74.112.186.144|:443... connected.
HTTP request sent, awaiting response... 301 Moved Permanently
Location: /public/static/uozg0z86rtdjupwpc7i971xwzuzhp42o.duckdb [following]
--2024-02-19 00:07:51--  https://arizona.box.com/public/static/uozg0z86rtdjupwpc7i971xwzuzhp42o.duckdb
Reusing existing connection to arizona.box.com:443.
HTTP request sent, awaiting response... 301 Moved Permanently
Location: https://arizona.app.box.com/public/static/uozg0z86rtdjupwpc7i971xwzuzhp42o.duckdb [following]
--2024-02-19 00:07:51--  https://arizona.app.box.com/public/static/uozg0z86rtdjupwpc7i971xwzuzhp42o.duckdb
Resolving arizona.app.box.com (arizona.app.box.com)... 74.112.186.144
Connecting to arizona.app.box.com (arizona.app.box.com)|74.112.186.144|:443... connected.
HTTP request sent, awaiting response... 302 Found
Location: https://public.boxcloud.com/d/1/b1!bsiUPxL7hmATNKcUNDHrJbqIs61NoBjYB5x-o3vtyas3Zzv6AtJDnk001KnoSWRvVzQArYIBQNxP32VLN1NOj0dsUZK92Tc3d5Ymzd6bt_n5HF2gJPdJ65ULQ7imrA0epK2exNTFNGFLqji5Q_9v6NMaUkMbVdkEpup7FSr5d7p5sGLq_AD-J0RKeAHr2ktLwRSEjIyNOiWM54b1rrQZL2BCJ1tR2oSODHFNBfLUrnmbEZci79ZHy-Rz1JpuBnTtps494cQ7MU4Qi-LLmj-M1PrrMvV2IDGu0AxWDfn3za8cRcwvImyJkWy6vWz_iYx41_mW07cOmrzmzCFwdP_s8ioJbffSFWKVX-TarQzVWcZwDPbqA7uiI26CTzhGxI6TSMCKp0_GBfSXZ84dBaWkiB60ko8KCyTguBjH3a7kKX9Jr9z2CJ9ZRHK4opfJi4CwlDGYNKxI-J4tvxU1-EIAhIxcPKlAzq7UeNopvMdDCof4OYDSoCzDJxwHLSW-A1O7T7GDnoETDzoqspB1a0-GPXsQ9MP0un63RaYGkssulYKpGUpoblPGGixvO6Y4De0Lcm9eHsrP8NQLxpEGhYo4OepZV5kH-0BM0nzOAggxxMzs1HgepCITQKBCEppS3lsx7ThSbghMV39GSoO2-jLMq1-XUBWIkyPRHCHFSNpzUiWQNWWFZeIoC_loKGNgephs_UhbX_79c9fS9m6GKkjLAuLcqNkBxW3CqYfjDmrCy-71m48czMJbp3WM2zZ19QdERVGHVnummr83-K9gFDERQ84CDVt1GKVcEh2xz9OgpbfHbm2X58NgcEboAUFx6H5EG9ES91Nn2jUaCRaKxxy56I-JVriFycM3v7kRzvEX09WfA4pmgM3QqhicOd8KfLnY8iQSrECaDO8kOQar7ps9J7Ou7R5FUdeqMEFVBVfyq9jbYFYNTm-lqN1DrJMJfJjTu5oEfPTj1CzWwlToO2GcSlamS_F2ZZSCkWcEXaC59wAmdP8RjP4GYW48SpWctNvMQIASjsY5ktz-HWc5z21zdpCLpw55jVSIaUeiC-5Km-coad-gPrZLuUkRlsCS4BOEboygfTdv93tDttZiaqrWx3U7aH71t_5yFWeBss8XTqNog_72ED3wM6iNvSdTuBGiawpK6Rb5WeuTTBeYw5WcCjMD0xb9pQ4fWWfd2nRkEIYBC-WzQk39QR03_pYYYKHsqPd8StGhY59t_C8AbX4VoBL0_kDOsf1sk104_E4UIveeKbr29opE20XOvLvtKO7enJlqqYsU9UfSQid7hdHtBiLOFchXDgTqlCl8_bUHe5QACXBfcHiXVtyHm2XYZR-WKUpLijxKtad33vsz31FYtUbk4p4zyUPOOCgfJP7zF9jGaurlMSh54NjldHDPFPaL/download [following]
--2024-02-19 00:07:51--  https://public.boxcloud.com/d/1/b1!bsiUPxL7hmATNKcUNDHrJbqIs61NoBjYB5x-o3vtyas3Zzv6AtJDnk001KnoSWRvVzQArYIBQNxP32VLN1NOj0dsUZK92Tc3d5Ymzd6bt_n5HF2gJPdJ65ULQ7imrA0epK2exNTFNGFLqji5Q_9v6NMaUkMbVdkEpup7FSr5d7p5sGLq_AD-J0RKeAHr2ktLwRSEjIyNOiWM54b1rrQZL2BCJ1tR2oSODHFNBfLUrnmbEZci79ZHy-Rz1JpuBnTtps494cQ7MU4Qi-LLmj-M1PrrMvV2IDGu0AxWDfn3za8cRcwvImyJkWy6vWz_iYx41_mW07cOmrzmzCFwdP_s8ioJbffSFWKVX-TarQzVWcZwDPbqA7uiI26CTzhGxI6TSMCKp0_GBfSXZ84dBaWkiB60ko8KCyTguBjH3a7kKX9Jr9z2CJ9ZRHK4opfJi4CwlDGYNKxI-J4tvxU1-EIAhIxcPKlAzq7UeNopvMdDCof4OYDSoCzDJxwHLSW-A1O7T7GDnoETDzoqspB1a0-GPXsQ9MP0un63RaYGkssulYKpGUpoblPGGixvO6Y4De0Lcm9eHsrP8NQLxpEGhYo4OepZV5kH-0BM0nzOAggxxMzs1HgepCITQKBCEppS3lsx7ThSbghMV39GSoO2-jLMq1-XUBWIkyPRHCHFSNpzUiWQNWWFZeIoC_loKGNgephs_UhbX_79c9fS9m6GKkjLAuLcqNkBxW3CqYfjDmrCy-71m48czMJbp3WM2zZ19QdERVGHVnummr83-K9gFDERQ84CDVt1GKVcEh2xz9OgpbfHbm2X58NgcEboAUFx6H5EG9ES91Nn2jUaCRaKxxy56I-JVriFycM3v7kRzvEX09WfA4pmgM3QqhicOd8KfLnY8iQSrECaDO8kOQar7ps9J7Ou7R5FUdeqMEFVBVfyq9jbYFYNTm-lqN1DrJMJfJjTu5oEfPTj1CzWwlToO2GcSlamS_F2ZZSCkWcEXaC59wAmdP8RjP4GYW48SpWctNvMQIASjsY5ktz-HWc5z21zdpCLpw55jVSIaUeiC-5Km-coad-gPrZLuUkRlsCS4BOEboygfTdv93tDttZiaqrWx3U7aH71t_5yFWeBss8XTqNog_72ED3wM6iNvSdTuBGiawpK6Rb5WeuTTBeYw5WcCjMD0xb9pQ4fWWfd2nRkEIYBC-WzQk39QR03_pYYYKHsqPd8StGhY59t_C8AbX4VoBL0_kDOsf1sk104_E4UIveeKbr29opE20XOvLvtKO7enJlqqYsU9UfSQid7hdHtBiLOFchXDgTqlCl8_bUHe5QACXBfcHiXVtyHm2XYZR-WKUpLijxKtad33vsz31FYtUbk4p4zyUPOOCgfJP7zF9jGaurlMSh54NjldHDPFPaL/download
Resolving public.boxcloud.com (public.boxcloud.com)... 74.112.186.128
Connecting to public.boxcloud.com (public.boxcloud.com)|74.112.186.128|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 770453504 (735M) [application/octet-stream]
Saving to: ‘my_database.duckdb’

my_database.duckdb  100%[===================>] 734.76M  64.3MB/s    in 11s

2024-02-19 00:08:03 (66.8 MB/s) - ‘my_database.duckdb’ saved [770453504/770453504]

In [ ]:
conn = duckdb.connect(database='/content/my_database.duckdb', read_only=True)

## Viewing what tables are available inside the database

In [ ]:
conn.sql("SHOW TABLES;")

┌───────────────────┐
│       name        │
│      varchar      │
├───────────────────┤
│ allergies         │
│ careplans         │
│ conditions        │
│ devices           │
│ encounters        │
│ imaging_studies   │
│ immunizations     │
│ medications       │
│ observations      │
│ organizations     │
│ patients          │
│ payer_transitions │
│ payers            │
│ procedures        │
│ providers         │
│ supplies          │
├───────────────────┤
│      16 rows      │
└───────────────────┘

## Before running any query we need to know the column names of particular tables

In [ ]:
conn.sql("DESCRIBE patients;")

┌─────────────────────┬─────────────┬─────────┬─────────┬─────────┬───────┐
│     column_name     │ column_type │  null   │   key   │ default │ extra │
│       varchar       │   varchar   │ varchar │ varchar │ varchar │ int32 │
├─────────────────────┼─────────────┼─────────┼─────────┼─────────┼───────┤
│ Id                  │ VARCHAR     │ YES     │ NULL    │ NULL    │  NULL │
│ BIRTHDATE           │ VARCHAR     │ YES     │ NULL    │ NULL    │  NULL │
│ DEATHDATE           │ VARCHAR     │ YES     │ NULL    │ NULL    │  NULL │
│ SSN                 │ VARCHAR     │ YES     │ NULL    │ NULL    │  NULL │
│ DRIVERS             │ VARCHAR     │ YES     │ NULL    │ NULL    │  NULL │
│ PASSPORT            │ VARCHAR     │ YES     │ NULL    │ NULL    │  NULL │
│ PREFIX              │ VARCHAR     │ YES     │ NULL    │ NULL    │  NULL │
│ FIRST               │ VARCHAR     │ YES     │ NULL    │ NULL    │  NULL │
│ LAST                │ VARCHAR     │ YES     │ NULL    │ NULL    │  NULL │
│ SUFFIX              │ VARCHAR     │ YES     │ NULL    │ NULL    │  NULL │
│   ·                 │    ·        │  ·      │  ·      │  ·      │    ·  │
│   ·                 │    ·        │  ·      │  ·      │  ·      │    ·  │
│   ·                 │    ·        │  ·      │  ·      │  ·      │    ·  │
│ BIRTHPLACE          │ VARCHAR     │ YES     │ NULL    │ NULL    │  NULL │
│ ADDRESS             │ VARCHAR     │ YES     │ NULL    │ NULL    │  NULL │
│ CITY                │ VARCHAR     │ YES     │ NULL    │ NULL    │  NULL │
│ STATE               │ VARCHAR     │ YES     │ NULL    │ NULL    │  NULL │
│ COUNTY              │ VARCHAR     │ YES     │ NULL    │ NULL    │  NULL │
│ ZIP                 │ DOUBLE      │ YES     │ NULL    │ NULL    │  NULL │
│ LAT                 │ DOUBLE      │ YES     │ NULL    │ NULL    │  NULL │
│ LON                 │ DOUBLE      │ YES     │ NULL    │ NULL    │  NULL │
│ HEALTHCARE_EXPENSES │ DOUBLE      │ YES     │ NULL    │ NULL    │  NULL │
│ HEALTHCARE_COVERAGE │ DOUBLE      │ YES     │ NULL    │ NULL    │  NULL │
├─────────────────────┴─────────────┴─────────┴─────────┴─────────┴───────┤
│ 25 rows (20 shown)                                            6 columns │
└─────────────────────────────────────────────────────────────────────────┘

In [ ]:
conn.sql("DESCRIBE medications;")

┌───────────────────┬─────────────┬─────────┬─────────┬─────────┬───────┐
│    column_name    │ column_type │  null   │   key   │ default │ extra │
│      varchar      │   varchar   │ varchar │ varchar │ varchar │ int32 │
├───────────────────┼─────────────┼─────────┼─────────┼─────────┼───────┤
│ START             │ VARCHAR     │ YES     │ NULL    │ NULL    │  NULL │
│ STOP              │ VARCHAR     │ YES     │ NULL    │ NULL    │  NULL │
│ PATIENT           │ VARCHAR     │ YES     │ NULL    │ NULL    │  NULL │
│ PAYER             │ VARCHAR     │ YES     │ NULL    │ NULL    │  NULL │
│ ENCOUNTER         │ VARCHAR     │ YES     │ NULL    │ NULL    │  NULL │
│ CODE              │ BIGINT      │ YES     │ NULL    │ NULL    │  NULL │
│ DESCRIPTION       │ VARCHAR     │ YES     │ NULL    │ NULL    │  NULL │
│ BASE_COST         │ DOUBLE      │ YES     │ NULL    │ NULL    │  NULL │
│ PAYER_COVERAGE    │ DOUBLE      │ YES     │ NULL    │ NULL    │  NULL │
│ DISPENSES         │ BIGINT      │ YES     │ NULL    │ NULL    │  NULL │
│ TOTALCOST         │ DOUBLE      │ YES     │ NULL    │ NULL    │  NULL │
│ REASONCODE        │ DOUBLE      │ YES     │ NULL    │ NULL    │  NULL │
│ REASONDESCRIPTION │ VARCHAR     │ YES     │ NULL    │ NULL    │  NULL │
├───────────────────┴─────────────┴─────────┴─────────┴─────────┴───────┤
│ 13 rows                                                     6 columns │
└───────────────────────────────────────────────────────────────────────┘

In [ ]:
conn.sql("DESCRIBE immunizations;")

┌─────────────┬─────────────┬─────────┬─────────┬─────────┬───────┐
│ column_name │ column_type │  null   │   key   │ default │ extra │
│   varchar   │   varchar   │ varchar │ varchar │ varchar │ int32 │
├─────────────┼─────────────┼─────────┼─────────┼─────────┼───────┤
│ DATE        │ VARCHAR     │ YES     │ NULL    │ NULL    │  NULL │
│ PATIENT     │ VARCHAR     │ YES     │ NULL    │ NULL    │  NULL │
│ ENCOUNTER   │ VARCHAR     │ YES     │ NULL    │ NULL    │  NULL │
│ CODE        │ BIGINT      │ YES     │ NULL    │ NULL    │  NULL │
│ DESCRIPTION │ VARCHAR     │ YES     │ NULL    │ NULL    │  NULL │
│ BASE_COST   │ DOUBLE      │ YES     │ NULL    │ NULL    │  NULL │
└─────────────┴─────────────┴─────────┴─────────┴─────────┴───────┘

<hr>
<hr>
<hr>

# **Workshop 04 Starts here**

 ## Introduction to Subqueries and Nested Selects

## Subqueries, also known as inner queries or nested queries, are SQL queries nested inside a larger query. They allow you to perform operations that usually require multiple steps in a single query, making your data retrieval process more efficient and concise. Nested selects are a type of subquery used specifically within the SELECT, FROM, or WHERE clauses to provide a dataset for the outer query to process.

 ### Subqueries can return a single value, a single row, multiple rows, or a table. They are used for comparison, as a condition, or to provide a list of values for the outer query. The main distinction between correlated and non-correlated subqueries is that correlated subqueries reference column(s) from the outer query, thus running once for each row selected by the outer query, while non-correlated subqueries run independently of the outer query and can be run as standalone queries.

## Types of subqueries

- **Single-Row Subqueries**: Single-row subqueries return only one row and are used with single row comparison operators like =, >, <, >=, <=. They are often used in the WHERE clause to compare a column value against the result of the subquery.
- **Multi-Row Subqueries**: Multi-row subqueries return more than one row and are used with operators like IN, ANY, ALL, which allow comparison against multiple values. They're useful for filtering based on a set of criteria returned by the subquery.
- **Correlated Subqueries**: Correlated subqueries reference column(s) from the outer query, making them dependent on the outer query. They are executed once for each row processed by the outer query, often leading to performance considerations.

Use subqueries to find patients based on specific criteria.

Find all patients who have been prescribed medication with a base cost higher than the average base cost of all medications.

In [ ]:
query = """SELECT p.FIRST, p.LAST
FROM patients p
WHERE p.Id IN (
    SELECT m.PATIENT
    FROM medications m
    WHERE m.BASE_COST > (SELECT AVG(BASE_COST) FROM medications)
);
"""

conn.sql(query)

┌─────────────┬─────────────┐
│    FIRST    │    LAST     │
│   varchar   │   varchar   │
├─────────────┼─────────────┤
│ Dewitt635   │ Reichel38   │
│ Anisa442    │ Purdy2      │
│ Ross213     │ Mayert710   │
│ Jim478      │ Mueller846  │
│ Maria750    │ Schimmel440 │
│ Ignacio928  │ Gorczany269 │
│ Kip442      │ Zboncak558  │
│ Jean712     │ Kuhlman484  │
│ Mac103      │ Moen819     │
│ Dianna917   │ Goldner995  │
│     ·       │    ·        │
│     ·       │    ·        │
│     ·       │    ·        │
│ Cameron381  │ Bogan287    │
│ Andrew29    │ Donnelly343 │
│ Charis952   │ Littel644   │
│ Lyndon118   │ Swift555    │
│ Edward499   │ Zieme486    │
│ Myron933    │ Ritchie586  │
│ Yolonda722  │ Champlin946 │
│ Alayna598   │ Kozey370    │
│ Kristian973 │ Ledner144   │
│ Sydney660   │ Zulauf375   │
├─────────────┴─────────────┤
│ ? rows          2 columns │
└───────────────────────────┘

### Correlated Subqueries

### Learn how to use correlated subqueries to perform row-specific comparisons.

### Find patients whose healthcare expenses are higher than the average expenses in their county.

In [ ]:
query = """SELECT
    p.FIRST,
    p.LAST,
    p.COUNTY,
    p.HEALTHCARE_EXPENSES,
    ROUND(AVG_EXPENSES.COUNTY_AVG_EXPENSES, 2) AS ROUNDED_AVG_HEALTHCARE_EXPENSES
FROM
    patients p
INNER JOIN (
    SELECT
        COUNTY,
        AVG(CAST(HEALTHCARE_EXPENSES AS DECIMAL(20,6))) AS COUNTY_AVG_EXPENSES
    FROM
        patients
    GROUP BY
        COUNTY
) AS AVG_EXPENSES ON p.COUNTY = AVG_EXPENSES.COUNTY
WHERE
    p.HEALTHCARE_EXPENSES > (
        SELECT AVG(p2.HEALTHCARE_EXPENSES)
        FROM patients p2
        WHERE p2.COUNTY = p.COUNTY
    );
"""
conn.sql(query)

┌────────────┬───────────────┬───────────────────┬─────────────────────┬─────────────────────────────────┐
│   FIRST    │     LAST      │      COUNTY       │ HEALTHCARE_EXPENSES │ ROUNDED_AVG_HEALTHCARE_EXPENSES │
│  varchar   │    varchar    │      varchar      │       double        │             double              │
├────────────┼───────────────┼───────────────────┼─────────────────────┼─────────────────────────────────┤
│ Tammy740   │ Ernser583     │ Bristol County    │          1546025.67 │                       793296.73 │
│ Iliana226  │ Schmeler639   │ Barnstable County │          1407960.93 │                       949155.23 │
│ Anthony633 │ Yundt842      │ Essex County      │          1575731.48 │                        814437.7 │
│ Jim478     │ Mueller846    │ Bristol County    │          1112473.78 │                       793296.73 │
│ Sina65     │ Howell947     │ Middlesex County  │          1479425.58 │                       841491.73 │
│ Maria750   │ Schimmel440   │ Plymouth County   │           952814.55 │                        856778.1 │
│ Lorenzo669 │ Vandervort697 │ Middlesex County  │           873001.47 │                       841491.73 │
│ David908   │ Carter549     │ Worcester County  │           834576.02 │                       804752.74 │
│ Noah480    │ O'Reilly797   │ Essex County      │            915110.6 │                        814437.7 │
│ Kip442     │ Zboncak558    │ Middlesex County  │  1704103.7200000002 │                       841491.73 │
│   ·        │     ·         │       ·           │               ·     │                           ·     │
│   ·        │     ·         │       ·           │               ·     │                           ·     │
│   ·        │     ·         │       ·           │               ·     │                           ·     │
│ Tinisha932 │ Zulauf375     │ Bristol County    │          1035244.36 │                       793296.73 │
│ Mario764   │ Estrada938    │ Suffolk County    │           1380401.5 │                       664340.79 │
│ Glenn0     │ Schulist381   │ Barnstable County │           1357123.8 │                       949155.23 │
│ Porter490  │ Schulist381   │ Bristol County    │          1534216.57 │                       793296.73 │
│ Darius626  │ Hackett68     │ Essex County      │          1715140.52 │                        814437.7 │
│ Leonel449  │ Kunze215      │ Essex County      │          1492352.86 │                        814437.7 │
│ Tyrell880  │ Kassulke119   │ Hampden County    │          1053520.21 │                       725636.71 │
│ Arlen68    │ Gusikowski974 │ Worcester County  │           1363289.9 │                       804752.74 │
│ Ashli227   │ Huel628       │ Worcester County  │           813730.02 │                       804752.74 │
│ Loriann967 │ Mertz280      │ Norfolk County    │          1618397.57 │                       874351.83 │
├────────────┴───────────────┴───────────────────┴─────────────────────┴─────────────────────────────────┤
│ ? rows (>9999 rows, 20 shown)                                                                5 columns │
└────────────────────────────────────────────────────────────────────────────────────────────────────────┘

### More examples of subqueries

### Identify patients who have not been prescribed any medication.

In [ ]:
query = """
SELECT p.FIRST, p.LAST
FROM patients p
WHERE NOT EXISTS (
    SELECT 1 FROM medications m WHERE m.PATIENT = p.Id
);
"""

conn.sql(query)

┌────────────┬───────────────┐
│   FIRST    │     LAST      │
│  varchar   │    varchar    │
├────────────┼───────────────┤
│ Iliana226  │ Schmeler639   │
│ Toshiko149 │ Swaniawski813 │
│ Heath320   │ Streich926    │
│ Rana586    │ Langworth352  │
│ Dorathy429 │ Yost751       │
│ Deon400    │ Littel644     │
│ Emerson869 │ D'Amore443    │
│ Alec433    │ Sanford861    │
│ Roselyn270 │ McLaughlin530 │
│ Claudia969 │ Smith67       │
│   ·        │    ·          │
│   ·        │    ·          │
│   ·        │    ·          │
│ Lou594     │ Gleason633    │
│ Hank686    │ Russel238     │
│ Earl438    │ Block661      │
│ Mariano761 │ Heller342     │
│ Sandra485  │ Fisher429     │
│ Claire652  │ Murray856     │
│ Doreen575  │ Graham902     │
│ Fausto876  │ Kuhn96        │
│ Vernon254  │ Gutmann970    │
│ Ernest565  │ Block661      │
├────────────┴───────────────┤
│ ? rows           2 columns │
└────────────────────────────┘

### Find patients whose healthcare coverage is above the average of their respective city.

In [ ]:
query = """
SELECT
    p.FIRST,
    p.LAST,
    p.CITY,
    ROUND(p.HEALTHCARE_COVERAGE,2) AS INDIVIDUAL_COVERAGE,
    ROUND(c.AVG_COVERAGE,2) AS CITY_AVERAGE_COVERAGE
FROM
    patients p
INNER JOIN (
    SELECT
        CITY,
        AVG(HEALTHCARE_COVERAGE) AS AVG_COVERAGE
    FROM
        patients
    GROUP BY
        CITY
) AS c ON p.CITY = c.CITY
WHERE
    p.HEALTHCARE_COVERAGE > (
        SELECT AVG(HEALTHCARE_COVERAGE)
        FROM patients
        WHERE CITY = p.CITY
    );
"""
conn.sql(query)

┌──────────────┬────────────────┬───────────────┬─────────────────────┬───────────────────────┐
│    FIRST     │      LAST      │     CITY      │ INDIVIDUAL_COVERAGE │ CITY_AVERAGE_COVERAGE │
│   varchar    │    varchar     │    varchar    │       double        │        double         │
├──────────────┼────────────────┼───────────────┼─────────────────────┼───────────────────────┤
│ Anisa442     │ Purdy2         │ Methuen       │            34393.57 │              12949.31 │
│ Sina65       │ Howell947      │ Sudbury       │            15481.43 │              15385.85 │
│ Maria750     │ Schimmel440    │ Plymouth      │            14231.22 │              10826.53 │
│ Kip442       │ Zboncak558     │ Hopkinton     │           155478.44 │              15439.17 │
│ Hans694      │ Wilkinson796   │ Framingham    │            13729.73 │              11988.99 │
│ Jean712      │ Kuhlman484     │ Boxford       │            11421.48 │               8660.53 │
│ Lorette239   │ Abbott774      │ Dennis        │            78740.23 │              14918.28 │
│ Tobi258      │ Bernier607     │ Wilmington    │             13889.6 │               9411.52 │
│ Rosia390     │ Reichel38      │ Rochester     │            16234.29 │               9736.74 │
│ Florencia449 │ Mercado213     │ Wilbraham     │            11427.25 │              10468.26 │
│   ·          │    ·           │    ·          │                ·    │                  ·    │
│   ·          │    ·           │    ·          │                ·    │                  ·    │
│   ·          │    ·           │    ·          │                ·    │                  ·    │
│ Jc393        │ Marks830       │ Brockton      │            16284.35 │              12287.77 │
│ Cedric746    │ Marvin195      │ Dedham        │            19806.72 │              13840.99 │
│ Milford485   │ Schmitt836     │ Hubbardston   │            10592.34 │               8172.48 │
│ Tegan755     │ Ruecker817     │ Waltham       │            30493.65 │              14495.07 │
│ Lindsay928   │ Lang846        │ Boston        │            11837.05 │               10725.8 │
│ Claudie965   │ Hermann103     │ Medford       │            15420.54 │              12610.05 │
│ Julie245     │ Nolan344       │ Essex         │            31903.53 │              31787.13 │
│ Mui729       │ Stoltenberg489 │ Wakefield     │            21528.91 │              13699.32 │
│ Oliver401    │ Lesch175       │ Yarmouth      │            27442.87 │              19907.83 │
│ Mi492        │ Gusikowski974  │ North Andover │            18481.09 │              17677.13 │
├──────────────┴────────────────┴───────────────┴─────────────────────┴───────────────────────┤
│ ? rows (>9999 rows, 20 shown)                                                     5 columns │
└─────────────────────────────────────────────────────────────────────────────────────────────┘

### For patients with records spanning multiple years, analyze the change in healthcare expenses.

In [ ]:
query = """SELECT CORR(p.HEALTHCARE_EXPENSES, p.HEALTHCARE_COVERAGE) AS CorrelationCoefficient
FROM patients p;
"""

conn.sql(query)

┌────────────────────────┐
│ CorrelationCoefficient │
│         double         │
├────────────────────────┤
│    0.18868010271196137 │
└────────────────────────┘

# FUNCTIONS IN SQL

## String Functions

## CONCAT: Concatenates two or more strings.

In [ ]:
query = """SELECT CONCAT(FIRST, ' ', LAST) AS FullName FROM patients LIMIT 10;
;"""


conn.sql(query)

┌───────────────────────────┐
│         FullName          │
│          varchar          │
├───────────────────────────┤
│ Jacinto644 Kris249        │
│ Alva958 Krajcik437        │
│ Jimmie93 Harris789        │
│ Gregorio366 Auer97        │
│ Karyn217 Mueller846       │
│ Jayson808 Fadel536        │
│ José Eduardo181 Gómez206  │
│ Milo271 Feil794           │
│ Karyn217 Metz686          │
│ Jeffrey461 Greenfelder433 │
├───────────────────────────┤
│          10 rows          │
└───────────────────────────┘

## DATALENGTH: Returns the number of bytes used to represent any expression.

In [ ]:
query = """
SELECT FIRST, LENGTH(FIRST) AS LengthInBytes FROM patients LIMIT 10;
"""

conn.sql(query)

┌─────────────────┬───────────────┐
│      FIRST      │ LengthInBytes │
│     varchar     │     int64     │
├─────────────────┼───────────────┤
│ Jacinto644      │            10 │
│ Alva958         │             7 │
│ Jimmie93        │             8 │
│ Gregorio366     │            11 │
│ Karyn217        │             8 │
│ Jayson808       │             9 │
│ José Eduardo181 │            15 │
│ Milo271         │             7 │
│ Karyn217        │             8 │
│ Jeffrey461      │            10 │
├─────────────────┴───────────────┤
│ 10 rows               2 columns │
└─────────────────────────────────┘

## LEFT: Returns the left part of a character string with the specified number of characters.

In [ ]:
query = """SELECT LEFT(FIRST, 5) AS Initial FROM patients LIMIT 10;"""
conn.sql(query)

┌─────────┐
│ Initial │
│ varchar │
├─────────┤
│ Jacin   │
│ Alva9   │
│ Jimmi   │
│ Grego   │
│ Karyn   │
│ Jayso   │
│ José    │
│ Milo2   │
│ Karyn   │
│ Jeffr   │
├─────────┤
│ 10 rows │
└─────────┘

## LOWER: Converts all characters in the specified string to lowercase.

## UPPER: Convert to uppercase

In [ ]:
query = """
SELECT LOWER(FIRST) AS LowercaseFirstName, UPPER(LAST) AS UppercaseLastName FROM patients LIMIT 10;
"""
conn.sql(query)

┌────────────────────┬───────────────────┐
│ LowercaseFirstName │ UppercaseLastName │
│      varchar       │      varchar      │
├────────────────────┼───────────────────┤
│ jacinto644         │ KRIS249           │
│ alva958            │ KRAJCIK437        │
│ jimmie93           │ HARRIS789         │
│ gregorio366        │ AUER97            │
│ karyn217           │ MUELLER846        │
│ jayson808          │ FADEL536          │
│ josé eduardo181    │ GÓMEZ206          │
│ milo271            │ FEIL794           │
│ karyn217           │ METZ686           │
│ jeffrey461         │ GREENFELDER433    │
├────────────────────┴───────────────────┤
│ 10 rows                      2 columns │
└────────────────────────────────────────┘

## LTRIM: Removes leading spaces from a string.

In [ ]:
query = """SELECT LTRIM(ADDRESS) AS TrimmedAddress FROM patients LIMIT 10;"""

conn.sql(query)

┌────────────────────────────────┐
│         TrimmedAddress         │
│            varchar             │
├────────────────────────────────┤
│ 888 Hickle Ferry Suite 38      │
│ 1048 Skiles Trailer            │
│ 201 Mitchell Lodge Unit 67     │
│ 1050 Lindgren Extension Apt 38 │
│ 570 Abshire Forge Suite 32     │
│ 1056 Harris Lane Suite 70      │
│ 427 Balistreri Way Unit 19     │
│ 422 Farrell Path Unit 69       │
│ 181 Feest Passage Suite 64     │
│ 428 Wiza Glen Unit 91          │
├────────────────────────────────┤
│            10 rows             │
└────────────────────────────────┘

## REPLACE: Replaces all occurrences of a specified string value with another string value.

In [ ]:
query = """SELECT FIRST, LAST,
    ADDRESS AS LongAddress,
    REPLACE(ADDRESS, 'Street', 'St') AS ShortAddress
FROM
    patients
WHERE
    ADDRESS LIKE '%Street%' LIMIT 10;
"""

conn.sql(query)

┌────────────┬───────────────┬───────────────────────────┬───────────────────────┐
│   FIRST    │     LAST      │        LongAddress        │     ShortAddress      │
│  varchar   │    varchar    │          varchar          │        varchar        │
├────────────┼───────────────┼───────────────────────────┼───────────────────────┤
│ Lorrie905  │ Leannon79     │ 813 Casper Street         │ 813 Casper St         │
│ Asa127     │ Block661      │ 140 Rohan Street Suite 50 │ 140 Rohan St Suite 50 │
│ Logan497   │ Brekke496     │ 1081 Orn Street           │ 1081 Orn St           │
│ Cletus494  │ Strosin214    │ 1019 Haley Street         │ 1019 Haley St         │
│ Cortney940 │ Stehr398      │ 458 Streich Street        │ 458 Streich St        │
│ Latoyia537 │ Gaylord332    │ 200 Heaney Street         │ 200 Heaney St         │
│ Clark193   │ Hilll811      │ 202 Tromp Street Suite 0  │ 202 Tromp St Suite 0  │
│ Jc393      │ Bosco882      │ 792 Walsh Street          │ 792 Walsh St          │
│ Noel608    │ Swaniawski813 │ 155 Walter Street         │ 155 Walter St         │
│ Sari509    │ Hoppe518      │ 550 Lang Street Suite 65  │ 550 Lang St Suite 65  │
├────────────┴───────────────┴───────────────────────────┴───────────────────────┤
│ 10 rows                                                              4 columns │
└────────────────────────────────────────────────────────────────────────────────┘

## RIGHT: Returns the right part of a character string with the specified number of characters.

In [ ]:
query = """SELECT FIRST, RIGHT(FIRST, 6) AS LastSixChars FROM patients LIMIT 10;
"""

conn.sql(query)

┌─────────────────┬──────────────┐
│      FIRST      │ LastSixChars │
│     varchar     │   varchar    │
├─────────────────┼──────────────┤
│ Jacinto644      │ nto644       │
│ Alva958         │ lva958       │
│ Jimmie93        │ mmie93       │
│ Gregorio366     │ rio366       │
│ Karyn217        │ ryn217       │
│ Jayson808       │ son808       │
│ José Eduardo181 │ rdo181       │
│ Milo271         │ ilo271       │
│ Karyn217        │ ryn217       │
│ Jeffrey461      │ rey461       │
├─────────────────┴──────────────┤
│ 10 rows              2 columns │
└────────────────────────────────┘

## SUBSTRING: Returns part of a character, binary, text, or image expression in SQL Server.

In [ ]:
query = """SELECT FIRST, SUBSTRING(FIRST, 1, 4) AS FirstFourChars FROM patients LIMIT 5;
"""

conn.sql(query)

┌─────────────┬────────────────┐
│    FIRST    │ FirstFourChars │
│   varchar   │    varchar     │
├─────────────┼────────────────┤
│ Jacinto644  │ Jaci           │
│ Alva958     │ Alva           │
│ Jimmie93    │ Jimm           │
│ Gregorio366 │ Greg           │
│ Karyn217    │ Kary           │
└─────────────┴────────────────┘

## REGEXP_REPLACE can use regular expressions to strip numeric characters:

In [ ]:
query = """SELECT
FIRST, REGEXP_REPLACE(FIRST, '[0-9]', '', 'g') AS FirstNameStripped, LAST, REGEXP_REPLACE(LAST, '[0-9]', '', 'g') AS LastNameStripped
FROM patients;
"""

conn.sql(query)

┌─────────────────┬───────────────────┬────────────────┬──────────────────┐
│      FIRST      │ FirstNameStripped │      LAST      │ LastNameStripped │
│     varchar     │      varchar      │    varchar     │     varchar      │
├─────────────────┼───────────────────┼────────────────┼──────────────────┤
│ Jacinto644      │ Jacinto           │ Kris249        │ Kris             │
│ Alva958         │ Alva              │ Krajcik437     │ Krajcik          │
│ Jimmie93        │ Jimmie            │ Harris789      │ Harris           │
│ Gregorio366     │ Gregorio          │ Auer97         │ Auer             │
│ Karyn217        │ Karyn             │ Mueller846     │ Mueller          │
│ Jayson808       │ Jayson            │ Fadel536       │ Fadel            │
│ José Eduardo181 │ José Eduardo      │ Gómez206       │ Gómez            │
│ Milo271         │ Milo              │ Feil794        │ Feil             │
│ Karyn217        │ Karyn             │ Metz686        │ Metz             │
│ Jeffrey461      │ Jeffrey           │ Greenfelder433 │ Greenfelder      │
│     ·           │    ·              │     ·          │    ·             │
│     ·           │    ·              │     ·          │    ·             │
│     ·           │    ·              │     ·          │    ·             │
│ Raymond398      │ Raymond           │ Kuvalis369     │ Kuvalis          │
│ Gearldine455    │ Gearldine         │ Boyer713       │ Boyer            │
│ Nichol11        │ Nichol            │ Gleichner915   │ Gleichner        │
│ Louvenia131     │ Louvenia          │ Marks830       │ Marks            │
│ Raymon366       │ Raymon            │ Beer512        │ Beer             │
│ Camelia346      │ Camelia           │ Stamm704       │ Stamm            │
│ William805      │ William           │ Pacocha935     │ Pacocha          │
│ Guillermo498    │ Guillermo         │ Téllez750      │ Téllez           │
│ Milton509       │ Milton            │ Bailey598      │ Bailey           │
│ Cecilia788      │ Cecilia           │ Wisozk929      │ Wisozk           │
├─────────────────┴───────────────────┴────────────────┴──────────────────┤
│ ? rows (>9999 rows, 20 shown)                                 4 columns │
└─────────────────────────────────────────────────────────────────────────┘

# Date/Time Functions

## CURRENT_TIMESTAMP: Returns the current database system timestamp as a datetime value.

In [ ]:
query = """SELECT CURRENT_TIMESTAMP AS CurrentDateTime;
"""

conn.sql(query)

┌───────────────────────────┐
│      CurrentDateTime      │
│ timestamp with time zone  │
├───────────────────────────┤
│ 2024-02-19 04:56:28.46+00 │
└───────────────────────────┘

### DATE_DIFF Calculates the difference between two dates.

In [ ]:
query = """SELECT DATE_DIFF('day', DATE '2024-01-01', DATE '2025-01-01') AS DaysDifference;


"""

conn.sql(query)

┌────────────────┐
│ DaysDifference │
│     int64      │
├────────────────┤
│            366 │
└────────────────┘

## DATEPART: Returns an integer representing the specified part of a date.

In [ ]:
query = """SELECT FIRST, LAST,BIRTHDATE,  DATE_PART('year', CAST(BIRTHDATE AS DATE)) AS YearOfBirth FROM patients LIMIT 10;
"""

conn.sql(query)

┌─────────────────┬────────────────┬────────────┬─────────────┐
│      FIRST      │      LAST      │ BIRTHDATE  │ YearOfBirth │
│     varchar     │    varchar     │  varchar   │    int64    │
├─────────────────┼────────────────┼────────────┼─────────────┤
│ Jacinto644      │ Kris249        │ 2017-08-24 │        2017 │
│ Alva958         │ Krajcik437     │ 2016-08-01 │        2016 │
│ Jimmie93        │ Harris789      │ 2004-01-09 │        2004 │
│ Gregorio366     │ Auer97         │ 1996-11-15 │        1996 │
│ Karyn217        │ Mueller846     │ 2019-06-12 │        2019 │
│ Jayson808       │ Fadel536       │ 1992-06-30 │        1992 │
│ José Eduardo181 │ Gómez206       │ 1989-06-22 │        1989 │
│ Milo271         │ Feil794        │ 1983-12-12 │        1983 │
│ Karyn217        │ Metz686        │ 1991-07-31 │        1991 │
│ Jeffrey461      │ Greenfelder433 │ 2005-01-16 │        2005 │
├─────────────────┴────────────────┴────────────┴─────────────┤
│ 10 rows                                           4 columns │
└─────────────────────────────────────────────────────────────┘

### CAST: Converts a value from one data type to another.

In [ ]:
query = """SELECT FIRST, LAST,HEALTHCARE_EXPENSES, CAST(HEALTHCARE_EXPENSES AS VARCHAR(20)) AS ExpensesText FROM patients LIMIT 10;
"""

conn.sql(query)

┌─────────────────┬────────────────┬─────────────────────┬──────────────┐
│      FIRST      │      LAST      │ HEALTHCARE_EXPENSES │ ExpensesText │
│     varchar     │    varchar     │       double        │   varchar    │
├─────────────────┼────────────────┼─────────────────────┼──────────────┤
│ Jacinto644      │ Kris249        │             8446.49 │ 8446.49      │
│ Alva958         │ Krajcik437     │             94568.4 │ 94568.4      │
│ Jimmie93        │ Harris789      │           375754.62 │ 375754.62    │
│ Gregorio366     │ Auer97         │           484758.46 │ 484758.46    │
│ Karyn217        │ Mueller846     │             24130.0 │ 24130.0      │
│ Jayson808       │ Fadel536       │           607481.92 │ 607481.92    │
│ José Eduardo181 │ Gómez206       │            33411.93 │ 33411.93     │
│ Milo271         │ Feil794        │           880850.51 │ 880850.51    │
│ Karyn217        │ Metz686        │           767029.01 │ 767029.01    │
│ Jeffrey461      │ Greenfelder433 │           352288.38 │ 352288.38    │
├─────────────────┴────────────────┴─────────────────────┴──────────────┤
│ 10 rows                                                     4 columns │
└───────────────────────────────────────────────────────────────────────┘

# Advanced Functions

### VERSION returns current duckDB version

In [ ]:
query = """SELECT VERSION();
"""

conn.sql(query)

┌───────────┐
│ version() │
│  varchar  │
├───────────┤
│ v0.9.2    │
└───────────┘

### CASE: Allows for conditional logic in SQL queries.

In [ ]:
query = """SELECT FIRST, LAST,
       CASE
           WHEN HEALTHCARE_EXPENSES > 10000 THEN 'High'
           ELSE 'Low'
       END AS ExpenseCategory
FROM patients;

"""

conn.sql(query)

┌─────────────────┬────────────────┬─────────────────┐
│      FIRST      │      LAST      │ ExpenseCategory │
│     varchar     │    varchar     │     varchar     │
├─────────────────┼────────────────┼─────────────────┤
│ Jacinto644      │ Kris249        │ Low             │
│ Alva958         │ Krajcik437     │ High            │
│ Jimmie93        │ Harris789      │ High            │
│ Gregorio366     │ Auer97         │ High            │
│ Karyn217        │ Mueller846     │ High            │
│ Jayson808       │ Fadel536       │ High            │
│ José Eduardo181 │ Gómez206       │ High            │
│ Milo271         │ Feil794        │ High            │
│ Karyn217        │ Metz686        │ High            │
│ Jeffrey461      │ Greenfelder433 │ High            │
│     ·           │     ·          │  ·              │
│     ·           │     ·          │  ·              │
│     ·           │     ·          │  ·              │
│ Raymond398      │ Kuvalis369     │ High            │
│ Gearldine455    │ Boyer713       │ High            │
│ Nichol11        │ Gleichner915   │ High            │
│ Louvenia131     │ Marks830       │ High            │
│ Raymon366       │ Beer512        │ High            │
│ Camelia346      │ Stamm704       │ High            │
│ William805      │ Pacocha935     │ High            │
│ Guillermo498    │ Téllez750      │ High            │
│ Milton509       │ Bailey598      │ High            │
│ Cecilia788      │ Wisozk929      │ High            │
├─────────────────┴────────────────┴─────────────────┤
│ ? rows (>9999 rows, 20 shown)            3 columns │
└────────────────────────────────────────────────────┘

## COALESCE: Returns the first non-null value in a list of arguments.

In [ ]:
query = """SELECT FIRST, COALESCE(DEATHDATE, 'N/A') AS DeathDate
FROM patients;

"""

conn.sql(query)

┌─────────────────┬────────────┐
│      FIRST      │ DeathDate  │
│     varchar     │  varchar   │
├─────────────────┼────────────┤
│ Jacinto644      │ N/A        │
│ Alva958         │ N/A        │
│ Jimmie93        │ N/A        │
│ Gregorio366     │ N/A        │
│ Karyn217        │ N/A        │
│ Jayson808       │ N/A        │
│ José Eduardo181 │ N/A        │
│ Milo271         │ N/A        │
│ Karyn217        │ N/A        │
│ Jeffrey461      │ N/A        │
│     ·           │  ·         │
│     ·           │  ·         │
│     ·           │  ·         │
│ Raymond398      │ N/A        │
│ Gearldine455    │ N/A        │
│ Nichol11        │ N/A        │
│ Louvenia131     │ N/A        │
│ Raymon366       │ 2020-03-23 │
│ Camelia346      │ N/A        │
│ William805      │ N/A        │
│ Guillermo498    │ N/A        │
│ Milton509       │ 2020-03-22 │
│ Cecilia788      │ N/A        │
├─────────────────┴────────────┤
│ ? rows             2 columns │
└──────────────────────────────┘

### CURRENT_USER: Returns the name of the current user.

In [ ]:
query = """SELECT CURRENT_USER AS CurrentUser;
"""

conn.sql(query)

┌─────────────┐
│ CurrentUser │
│   varchar   │
├─────────────┤
│ duckdb      │
└─────────────┘

# Creating and Adding Data to tables

CREATE, ALTER, DROP, INSERT commands

## First lets have a inmemory database

In [ ]:
newdb = duckdb.connect()

## CREATE TABLE: Create a books table to mimic a library catalog system.

In [ ]:
query = """CREATE TABLE books (
    book_id INTEGER PRIMARY KEY,
    title VARCHAR,
    author VARCHAR,
    published_year INTEGER
);
"""

newdb.sql(query)

### The CREATE TABLE statement defines the schema for this table:

### This statement creates a table with columns for the book ID, title, author, and the year of publication. The book_id column is designated as the primary key, ensuring that each record in the table is unique.

## check

In [ ]:
newdb.sql("SHOW TABLES;")

┌─────────┐
│  name   │
│ varchar │
├─────────┤
│ books   │
└─────────┘

## check data

In [ ]:
newdb.sql("DESCRIBE books;")

┌────────────────┬─────────────┬─────────┬─────────┬─────────┬───────┐
│  column_name   │ column_type │  null   │   key   │ default │ extra │
│    varchar     │   varchar   │ varchar │ varchar │ varchar │ int32 │
├────────────────┼─────────────┼─────────┼─────────┼─────────┼───────┤
│ book_id        │ INTEGER     │ NO      │ PRI     │ NULL    │  NULL │
│ title          │ VARCHAR     │ YES     │ NULL    │ NULL    │  NULL │
│ author         │ VARCHAR     │ YES     │ NULL    │ NULL    │  NULL │
│ published_year │ INTEGER     │ YES     │ NULL    │ NULL    │  NULL │
└────────────────┴─────────────┴─────────┴─────────┴─────────┴───────┘

## Alter Table: After creating the table, you might need to add more information. Use the ALTER TABLE statement to add a new column:

In [ ]:
query = """ALTER TABLE books ADD COLUMN genre VARCHAR;
"""
newdb.sql(query)
# This adds a genre column to the books table, allowing you to categorize books.

## check

In [ ]:
newdb.sql("DESCRIBE books;")

┌────────────────┬─────────────┬─────────┬─────────┬─────────┬───────┐
│  column_name   │ column_type │  null   │   key   │ default │ extra │
│    varchar     │   varchar   │ varchar │ varchar │ varchar │ int32 │
├────────────────┼─────────────┼─────────┼─────────┼─────────┼───────┤
│ book_id        │ INTEGER     │ NO      │ PRI     │ NULL    │  NULL │
│ title          │ VARCHAR     │ YES     │ NULL    │ NULL    │  NULL │
│ author         │ VARCHAR     │ YES     │ NULL    │ NULL    │  NULL │
│ published_year │ INTEGER     │ YES     │ NULL    │ NULL    │  NULL │
│ genre          │ VARCHAR     │ YES     │ NULL    │ NULL    │  NULL │
└────────────────┴─────────────┴─────────┴─────────┴─────────┴───────┘

### let's add another which we will DROP later;

In [ ]:
query = """CREATE TABLE authors (
    author_id INTEGER PRIMARY KEY,
    firstname VARCHAR,
    lastname VARCHAR,
    birth_year INTEGER
);
"""

newdb.sql(query)

## check

In [ ]:
newdb.sql("SHOW TABLES;")

┌─────────┐
│  name   │
│ varchar │
├─────────┤
│ authors │
│ books   │
└─────────┘

## Now let's **DROP** the author table

In [ ]:
query = """DROP TABLE IF EXISTS authors;
"""

newdb.sql(query)

## check again

In [ ]:
newdb.sql("SHOW TABLES;")

┌─────────┐
│  name   │
│ varchar │
├─────────┤
│ books   │
└─────────┘

#### Let's add some data first

### **INSERT** To populate the books table with data. This inserts 10 records into the books table, providing a diverse set of examples.

In [ ]:
query = """INSERT INTO books (book_id, title, author, published_year, genre) VALUES
(1, '1984', 'George Orwell', 1949, 'Dystopian'),
(2, 'The Great Gatsby', 'F. Scott Fitzgerald', 1925, 'Classic'),
(3, 'To Kill a Mockingbird', 'Harper Lee', 1960, 'Classic'),
(4, 'Pride and Prejudice', 'Jane Austen', 1813, 'Romance'),
(5, 'The Hobbit', 'J.R.R. Tolkien', 1937, 'Fantasy'),
(6, 'The Catcher in the Rye', 'J.D. Salinger', 1951, 'Literary Fiction'),
(7, 'Harry Potter and the Sorcerer’s Stone', 'J.K. Rowling', 1997, 'Fantasy'),
(8, 'The Da Vinci Code', 'Dan Brown', 2003, 'Thriller'),
(9, 'Sapiens: A Brief History of Humankind', 'Yuval Noah Harari', 2011, 'Non-fiction'),
(10, 'Beloved', 'Toni Morrison', 1987, 'Historical Fiction');"""

newdb.sql(query)

## check

In [ ]:
query = """SELECT title AS "Book Title", author AS "Author Name", Genre FROM books;
"""

newdb.sql(query)

┌───────────────────────────────────────┬─────────────────────┬────────────────────┐
│              Book Title               │     Author Name     │       genre        │
│                varchar                │       varchar       │      varchar       │
├───────────────────────────────────────┼─────────────────────┼────────────────────┤
│ 1984                                  │ George Orwell       │ Dystopian          │
│ The Great Gatsby                      │ F. Scott Fitzgerald │ Classic            │
│ To Kill a Mockingbird                 │ Harper Lee          │ Classic            │
│ Pride and Prejudice                   │ Jane Austen         │ Romance            │
│ The Hobbit                            │ J.R.R. Tolkien      │ Fantasy            │
│ The Catcher in the Rye                │ J.D. Salinger       │ Literary Fiction   │
│ Harry Potter and the Sorcerer’s Stone │ J.K. Rowling        │ Fantasy            │
│ The Da Vinci Code                     │ Dan Brown           │ Thriller           │
│ Sapiens: A Brief History of Humankind │ Yuval Noah Harari   │ Non-fiction        │
│ Beloved                               │ Toni Morrison       │ Historical Fiction │
├───────────────────────────────────────┴─────────────────────┴────────────────────┤
│ 10 rows                                                                3 columns │
└──────────────────────────────────────────────────────────────────────────────────┘

### Updating Data: **UPDATE**
### This changes the genre of the book titled '1984' to 'Science Fiction'.

In [ ]:
query = """UPDATE books SET genre = 'Science Fiction' WHERE title = '1984';
"""

newdb.sql(query)

### check

In [ ]:
query = """SELECT title AS "Book Title", author AS "Author Name", Genre FROM books;
"""

newdb.sql(query)

┌───────────────────────────────────────┬─────────────────────┬────────────────────┐
│              Book Title               │     Author Name     │       genre        │
│                varchar                │       varchar       │      varchar       │
├───────────────────────────────────────┼─────────────────────┼────────────────────┤
│ 1984                                  │ George Orwell       │ Science Fiction    │
│ The Great Gatsby                      │ F. Scott Fitzgerald │ Classic            │
│ To Kill a Mockingbird                 │ Harper Lee          │ Classic            │
│ Pride and Prejudice                   │ Jane Austen         │ Romance            │
│ The Hobbit                            │ J.R.R. Tolkien      │ Fantasy            │
│ The Catcher in the Rye                │ J.D. Salinger       │ Literary Fiction   │
│ Harry Potter and the Sorcerer’s Stone │ J.K. Rowling        │ Fantasy            │
│ The Da Vinci Code                     │ Dan Brown           │ Thriller           │
│ Sapiens: A Brief History of Humankind │ Yuval Noah Harari   │ Non-fiction        │
│ Beloved                               │ Toni Morrison       │ Historical Fiction │
├───────────────────────────────────────┴─────────────────────┴────────────────────┤
│ 10 rows                                                                3 columns │
└──────────────────────────────────────────────────────────────────────────────────┘

## **DELETE** To remove a book from the catalog

In [ ]:
query = """DELETE FROM books WHERE title = 'The Great Gatsby';"""
newdb.sql(query)

## check

In [ ]:
query = """SELECT title AS "Book Title", author AS "Author Name", Genre FROM books;
"""

newdb.sql(query)

┌───────────────────────────────────────┬───────────────────┬────────────────────┐
│              Book Title               │    Author Name    │       genre        │
│                varchar                │      varchar      │      varchar       │
├───────────────────────────────────────┼───────────────────┼────────────────────┤
│ 1984                                  │ George Orwell     │ Science Fiction    │
│ To Kill a Mockingbird                 │ Harper Lee        │ Classic            │
│ Pride and Prejudice                   │ Jane Austen       │ Romance            │
│ The Hobbit                            │ J.R.R. Tolkien    │ Fantasy            │
│ The Catcher in the Rye                │ J.D. Salinger     │ Literary Fiction   │
│ Harry Potter and the Sorcerer’s Stone │ J.K. Rowling      │ Fantasy            │
│ The Da Vinci Code                     │ Dan Brown         │ Thriller           │
│ Sapiens: A Brief History of Humankind │ Yuval Noah Harari │ Non-fiction        │
│ Beloved                               │ Toni Morrison     │ Historical Fiction │
└───────────────────────────────────────┴───────────────────┴────────────────────┘

### **TRUNCATE**

#### The TRUNCATE TABLE statement is used to delete all rows in a table without logging the individual row deletions. This is faster than using DELETE without a WHERE clause because TRUNCATE immediately deallocates data pages used by the table. Use TRUNCATE when you want to quickly remove all records from a table but keep the table structure for future use. Unlike DELETE, TRUNCATE does not generate a large number of transaction logs, making it more efficient for completely clearing a table.

In [ ]:
query = """TRUNCATE TABLE books;"""

newdb.sql(query)

### check

In [ ]:
query = """SELECT * FROM books;
"""

newdb.sql(query)

┌─────────┬───────────────────────────────────────┬─────────────────────┬────────────────┬────────────────────┐
│ book_id │                 title                 │       author        │ published_year │       genre        │
│  int32  │                varchar                │       varchar       │     int32      │      varchar       │
├─────────┼───────────────────────────────────────┼─────────────────────┼────────────────┼────────────────────┤
│       1 │ 1984                                  │ George Orwell       │           1949 │ Dystopian          │
│       2 │ The Great Gatsby                      │ F. Scott Fitzgerald │           1925 │ Classic            │
│       3 │ To Kill a Mockingbird                 │ Harper Lee          │           1960 │ Classic            │
│       4 │ Pride and Prejudice                   │ Jane Austen         │           1813 │ Romance            │
│       5 │ The Hobbit                            │ J.R.R. Tolkien      │           1937 │ Fantasy            │
│       6 │ The Catcher in the Rye                │ J.D. Salinger       │           1951 │ Literary Fiction   │
│       7 │ Harry Potter and the Sorcerer’s Stone │ J.K. Rowling        │           1997 │ Fantasy            │
│       8 │ The Da Vinci Code                     │ Dan Brown           │           2003 │ Thriller           │
│       9 │ Sapiens: A Brief History of Humankind │ Yuval Noah Harari   │           2011 │ Non-fiction        │
│      10 │ Beloved                               │ Toni Morrison       │           1987 │ Historical Fiction │
├─────────┴───────────────────────────────────────┴─────────────────────┴────────────────┴────────────────────┤
│ 10 rows                                                                                           5 columns │
└─────────────────────────────────────────────────────────────────────────────────────────────────────────────┘

## Adding one more table; named 'authors'

In [ ]:
query = """CREATE TABLE authors (
    author_id INTEGER PRIMARY KEY,
    name VARCHAR,
    birth_year INTEGER,
    nationality VARCHAR
);
"""

newdb.sql(query)

### Add information the authors table

In [ ]:
query = """INSERT INTO authors (author_id, name, birth_year, nationality) VALUES
(1, 'George Orwell', 1903, 'British'),
(2, 'F. Scott Fitzgerald', 1896, 'American'),
(3, 'Harper Lee', 1926, 'American'),
(4, 'Jane Austen', 1775, 'British'),
(5, 'J.R.R. Tolkien', 1892, 'British'),
(6, 'J.D. Salinger', 1919, 'American'),
(7, 'J.K. Rowling', 1965, 'British'),
(8, 'Dan Brown', 1964, 'American'),
(9, 'Yuval Noah Harari', 1976, 'Israeli'),
(10, 'Toni Morrison', 1931, 'American');
"""


newdb.sql(query)

In [ ]:
query = """SELECT * FROM books;
"""

newdb.sql(query)

┌─────────┬───────────────────────────────────────┬─────────────────────┬────────────────┬────────────────────┐
│ book_id │                 title                 │       author        │ published_year │       genre        │
│  int32  │                varchar                │       varchar       │     int32      │      varchar       │
├─────────┼───────────────────────────────────────┼─────────────────────┼────────────────┼────────────────────┤
│       1 │ 1984                                  │ George Orwell       │           1949 │ Dystopian          │
│       2 │ The Great Gatsby                      │ F. Scott Fitzgerald │           1925 │ Classic            │
│       3 │ To Kill a Mockingbird                 │ Harper Lee          │           1960 │ Classic            │
│       4 │ Pride and Prejudice                   │ Jane Austen         │           1813 │ Romance            │
│       5 │ The Hobbit                            │ J.R.R. Tolkien      │           1937 │ Fantasy            │
│       6 │ The Catcher in the Rye                │ J.D. Salinger       │           1951 │ Literary Fiction   │
│       7 │ Harry Potter and the Sorcerer’s Stone │ J.K. Rowling        │           1997 │ Fantasy            │
│       8 │ The Da Vinci Code                     │ Dan Brown           │           2003 │ Thriller           │
│       9 │ Sapiens: A Brief History of Humankind │ Yuval Noah Harari   │           2011 │ Non-fiction        │
│      10 │ Beloved                               │ Toni Morrison       │           1987 │ Historical Fiction │
├─────────┴───────────────────────────────────────┴─────────────────────┴────────────────┴────────────────────┤
│ 10 rows                                                                                           5 columns │
└─────────────────────────────────────────────────────────────────────────────────────────────────────────────┘

In [ ]:
query = """SELECT * FROM authors;
"""

newdb.sql(query)

┌───────────┬─────────────────────┬────────────┬─────────────┐
│ author_id │        name         │ birth_year │ nationality │
│   int32   │       varchar       │   int32    │   varchar   │
├───────────┼─────────────────────┼────────────┼─────────────┤
│         1 │ George Orwell       │       1903 │ British     │
│         2 │ F. Scott Fitzgerald │       1896 │ American    │
│         3 │ Harper Lee          │       1926 │ American    │
│         4 │ Jane Austen         │       1775 │ British     │
│         5 │ J.R.R. Tolkien      │       1892 │ British     │
│         6 │ J.D. Salinger       │       1919 │ American    │
│         7 │ J.K. Rowling        │       1965 │ British     │
│         8 │ Dan Brown           │       1964 │ American    │
│         9 │ Yuval Noah Harari   │       1976 │ Israeli     │
│        10 │ Toni Morrison       │       1931 │ American    │
├───────────┴─────────────────────┴────────────┴─────────────┤
│ 10 rows                                          4 columns │
└────────────────────────────────────────────────────────────┘

## **EXPORTING** Data to csv from SQL

In [ ]:
query = """EXPORT DATABASE './' (FORMAT CSV, DELIMITER ',');"""

newdb.sql(query)

## Reading csv files and importing data

In [ ]:
import pandas as pd

In [ ]:
import glob

In [ ]:
import glob
csv_files = glob.glob('*.csv')

In [ ]:
csv_files

['books.csv', 'authors.csv']

### Step 1: Connect to DuckDB (this creates an empty database in memory; specify a filename for a persistent database)

In [ ]:
dbfromcsv = duckdb.connect('library.duckdb')

In [ ]:
# Step 3: Process each CSV file
for csv_file in csv_files:
    # Read the CSV file into a pandas DataFrame
    df = pd.read_csv(csv_file)

    # Derive table name from CSV file name (optional)
    table_name = csv_file.split('.')[0]  # This splits the filename from its extension and uses the name as the table name

    # Create table and insert data
    # DuckDB can directly execute pandas DataFrames
    dbfromcsv.register('temp_df', df)
    dbfromcsv.sql(f"CREATE TABLE IF NOT EXISTS {table_name} AS SELECT * FROM temp_df WHERE false;")  # Create table with schema
    dbfromcsv.sql(f"INSERT INTO {table_name} SELECT * FROM temp_df;")
    dbfromcsv.unregister('temp_df')

In [ ]:
# Step 4: Close the connection
dbfromcsv.close()

In [ ]:
libdb = duckdb.connect('/content/library.duckdb')

In [ ]:
libdb.sql("SHOW TABLES;")

┌─────────┐
│  name   │
│ varchar │
├─────────┤
│ authors │
│ books   │
└─────────┘

In [ ]:
query = """SELECT * FROM books;
"""

libdb.sql(query)

┌─────────┬───────────────────────────────────────┬─────────────────────┬────────────────┬────────────────────┐
│ book_id │                 title                 │       author        │ published_year │       genre        │
│  int64  │                varchar                │       varchar       │     int64      │      varchar       │
├─────────┼───────────────────────────────────────┼─────────────────────┼────────────────┼────────────────────┤
│       1 │ 1984                                  │ George Orwell       │           1949 │ Dystopian          │
│       2 │ The Great Gatsby                      │ F. Scott Fitzgerald │           1925 │ Classic            │
│       3 │ To Kill a Mockingbird                 │ Harper Lee          │           1960 │ Classic            │
│       4 │ Pride and Prejudice                   │ Jane Austen         │           1813 │ Romance            │
│       5 │ The Hobbit                            │ J.R.R. Tolkien      │           1937 │ Fantasy            │
│       6 │ The Catcher in the Rye                │ J.D. Salinger       │           1951 │ Literary Fiction   │
│       7 │ Harry Potter and the Sorcerer’s Stone │ J.K. Rowling        │           1997 │ Fantasy            │
│       8 │ The Da Vinci Code                     │ Dan Brown           │           2003 │ Thriller           │
│       9 │ Sapiens: A Brief History of Humankind │ Yuval Noah Harari   │           2011 │ Non-fiction        │
│      10 │ Beloved                               │ Toni Morrison       │           1987 │ Historical Fiction │
├─────────┴───────────────────────────────────────┴─────────────────────┴────────────────┴────────────────────┤
│ 10 rows                                                                                           5 columns │
└─────────────────────────────────────────────────────────────────────────────────────────────────────────────┘

In [ ]:
query = """SELECT * FROM authors;
"""

libdb.sql(query)

┌───────────┬─────────────────────┬────────────┬─────────────┐
│ author_id │        name         │ birth_year │ nationality │
│   int64   │       varchar       │   int64    │   varchar   │
├───────────┼─────────────────────┼────────────┼─────────────┤
│         1 │ George Orwell       │       1903 │ British     │
│         2 │ F. Scott Fitzgerald │       1896 │ American    │
│         3 │ Harper Lee          │       1926 │ American    │
│         4 │ Jane Austen         │       1775 │ British     │
│         5 │ J.R.R. Tolkien      │       1892 │ British     │
│         6 │ J.D. Salinger       │       1919 │ American    │
│         7 │ J.K. Rowling        │       1965 │ British     │
│         8 │ Dan Brown           │       1964 │ American    │
│         9 │ Yuval Noah Harari   │       1976 │ Israeli     │
│        10 │ Toni Morrison       │       1931 │ American    │
├───────────┴─────────────────────┴────────────┴─────────────┤
│ 10 rows                                          4 columns │
└────────────────────────────────────────────────────────────┘

# 🙏 **Thank You**